---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.DisconnectElements
source: html/19dafbc8-d4b0-dc39-3242-0a37c95ec44f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.DisconnectElements Property

Disconnect the coupler from the connected bar.

## Syntax (C#)
```csharp
public static FailureDefinitionId DisconnectElements { get; }
```